#pragma once
#include <TopoDS_Shape.hxx>
#include "libvector.h"
#include "sketch_widget.h"

struct Model
{
    virtual ~Model() = default;

    TopoDS_Shape shape;
    std::vector<std::array<vec3<float>, 3>> vertex;
    std::vector<std::vector<float>> params_table;
    QStringList params_table_headings;
    char selectedParameters = 0;
    char selectedExecution = 1;

    std::function<void(std::string)> onStatus = nullptr;

    virtual void initModel3D() = 0;
    virtual void drawSketch(SketchWidget *sketch) = 0;
    void generateMesh();
};

struct Cube : Model
{
    void initModel3D() override;
    void drawSketch(SketchWidget *sketch) override;
};

struct HalfCoupling : Model {
    HalfCoupling() {
        params_table = {
            // --- ТАБЛИЦА 1 ---
            {2.5f, 6.0f, 0.0f, 7.0f, 0.0f, 2.0f, 20.0f, 32.0f, 16.0f, 0.0f, 28.0f, 0.0f, 0.0f, 0.0f, 4.0f, 16.0f, 0.1f, 0.08f, 0.0f},
            {2.5f, 7.0f, 0.0f, 8.0f, 0.0f, 2.0f, 20.0f, 32.0f, 16.0f, 0.0f, 28.0f, 0.0f, 0.0f, 0.0f, 4.0f, 16.0f, 0.1f, 0.07f, 0.0f},
            {6.3f, 10.0f, 0.0f, 11.4f, 0.0f, 3.0f, 22.0f, 45.0f, 23.0f, 20.0f, 35.0f, 32.0f, 0.0f, 0.0f, 5.0f, 20.0f, 0.1f, 0.12f, 0.11f},
            {6.3f, 11.0f, 0.0f, 12.8f, 0.0f, 3.0f, 22.0f, 45.0f, 23.0f, 20.0f, 35.0f, 32.0f, 0.0f, 0.0f, 5.0f, 20.0f, 0.1f, 0.11f, 0.10f},
            {6.3f, 12.0f, 0.0f, 13.8f, 0.0f, 4.0f, 24.0f, 45.0f, 30.0f, 25.0f, 42.0f, 37.0f, 0.0f, 0.0f, 5.0f, 20.0f, 0.1f, 0.13f, 0.12f},
            {6.3f, 14.0f, 0.0f, 16.3f, 0.0f, 5.0f, 26.0f, 45.0f, 30.0f, 25.0f, 42.0f, 37.0f, 0.0f, 0.0f, 5.0f, 20.0f, 0.2f, 0.15f, 0.13f},

            // --- ТАБЛИЦА 2 ---
            {16.0f, 12.0f, 0.0f, 13.8f, 0.0f, 4.0f, 26.0f, 53.0f, 30.0f, 25.0f, 48.0f, 43.0f, 28.0f, 15.0f, 5.0f, 14.0f, 0.1f, 0.28f, 0.27f},
            {16.0f, 14.0f, 0.0f, 16.3f, 0.0f, 5.0f, 26.0f, 53.0f, 30.0f, 25.0f, 48.0f, 43.0f, 28.0f, 15.0f, 5.0f, 14.0f, 0.2f, 0.27f, 0.26f},
            {16.0f, 16.0f, 0.0f, 18.3f, 0.0f, 5.0f, 28.0f, 53.0f, 40.0f, 28.0f, 58.0f, 46.0f, 28.0f, 15.0f, 5.0f, 14.0f, 0.2f, 0.31f, 0.28f},
            {16.0f, 18.0f, 0.0f, 20.8f, 0.0f, 6.0f, 28.0f, 53.0f, 40.0f, 28.0f, 58.0f, 46.0f, 28.0f, 15.0f, 5.0f, 14.0f, 0.2f, 0.30f, 0.26f},

            {25.0f, 14.0f, 0.0f, 16.3f, 0.0f, 5.0f, 28.0f, 63.0f, 30.0f, 25.0f, 48.0f, 43.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.34f, 0.29f},
            {25.0f, 16.0f, 0.0f, 18.3f, 0.0f, 5.0f, 28.0f, 63.0f, 40.0f, 28.0f, 58.0f, 46.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.38f, 0.31f},
            {25.0f, 18.0f, 0.0f, 20.8f, 0.0f, 6.0f, 28.0f, 63.0f, 40.0f, 28.0f, 58.0f, 46.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.37f, 0.30f},
            {25.0f, 0.0f, 19.0f, 21.8f, 0.0f, 6.0f, 30.0f, 63.0f, 40.0f, 28.0f, 58.0f, 46.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.35f, 0.28f},
            {25.0f, 20.0f, 0.0f, 22.8f, 0.0f, 6.0f, 30.0f, 71.0f, 50.0f, 36.0f, 68.0f, 54.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.42f, 0.33f},

            {31.5f, 16.0f, 0.0f, 18.3f, 0.0f, 5.0f, 30.0f, 71.0f, 50.0f, 36.0f, 68.0f, 54.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.48f, 0.34f},
            {31.5f, 18.0f, 0.0f, 20.8f, 0.0f, 5.0f, 30.0f, 71.0f, 40.0f, 28.0f, 58.0f, 46.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.47f, 0.32f},
            {31.5f, 0.0f, 19.0f, 21.8f, 0.0f, 6.0f, 30.0f, 71.0f, 40.0f, 28.0f, 58.0f, 46.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.45f, 0.33f},
            {31.5f, 22.0f, 0.0f, 24.8f, 0.0f, 6.0f, 34.0f, 71.0f, 50.0f, 36.0f, 68.0f, 54.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.55f, 0.41f},
            {31.5f, 22.0f, 0.0f, 24.8f, 0.0f, 6.0f, 36.0f, 71.0f, 50.0f, 36.0f, 75.0f, 61.0f, 28.0f, 15.0f, 6.0f, 16.0f, 0.2f, 0.53f, 0.39f},

            {63.0f, 20.0f, 0.0f, 22.8f, 0.0f, 6.0f, 36.0f, 85.0f, 50.0f, 36.0f, 75.0f, 61.0f, 40.0f, 22.0f, 7.0f, 21.0f, 0.2f, 0.86f, 0.79f},
            {63.0f, 22.0f, 0.0f, 24.8f, 0.0f, 6.0f, 36.0f, 85.0f, 50.0f, 36.0f, 75.0f, 61.0f, 40.0f, 22.0f, 7.0f, 21.0f, 0.2f, 0.83f, 0.78f},
            {63.0f, 0.0f, 24.0f, 27.3f, 0.0f, 6.0f, 36.0f, 85.0f, 50.0f, 36.0f, 75.0f, 61.0f, 40.0f, 22.0f, 7.0f, 21.0f, 0.2f, 0.79f, 0.74f},
            {63.0f, 25.0f, 0.0f, 28.3f, 0.0f, 8.0f, 42.0f, 85.0f, 60.0f, 42.0f, 85.0f, 67.0f, 40.0f, 22.0f, 7.0f, 21.0f, 0.2f, 0.95f, 0.76f},
            {63.0f, 28.0f, 0.0f, 31.3f, 0.0f, 8.0f, 42.0f, 85.0f, 60.0f, 42.0f, 85.0f, 67.0f, 40.0f, 22.0f, 7.0f, 21.0f, 0.2f, 0.90f, 0.71f},

            // --- ПРОДОЛЖЕНИЕ ТАБЛ. 2 ---
            {125.0f, 25.0f, 0.0f, 28.3f, 0.0f, 8.0f, 45.0f, 105.0f, 60.0f, 42.0f, 85.0f, 67.0f, 40.0f, 22.0f, 8.0f, 25.0f, 0.2f, 1.59f, 1.46f},
            {125.0f, 28.0f, 0.0f, 31.3f, 0.0f, 8.0f, 45.0f, 105.0f, 60.0f, 42.0f, 85.0f, 67.0f, 40.0f, 22.0f, 8.0f, 25.0f, 0.2f, 1.52f, 1.35f},
            {125.0f, 30.0f, 0.0f, 33.3f, 33.8f, 8.0f, 45.0f, 105.0f, 80.0f, 58.0f, 105.0f, 83.0f, 40.0f, 22.0f, 8.0f, 25.0f, 0.2f, 1.60f, 1.45f},
            {125.0f, 32.0f, 0.0f, 35.3f, 35.8f, 10.0f, 48.0f, 105.0f, 80.0f, 58.0f, 105.0f, 83.0f, 40.0f, 22.0f, 8.0f, 25.0f, 0.3f, 1.59f, 1.51f},
            {125.0f, 35.0f, 0.0f, 38.3f, 38.8f, 10.0f, 52.0f, 105.0f, 80.0f, 58.0f, 105.0f, 83.0f, 40.0f, 22.0f, 8.0f, 25.0f, 0.3f, 1.63f, 1.55f},
            {125.0f, 36.0f, 0.0f, 39.3f, 39.8f, 10.0f, 55.0f, 105.0f, 80.0f, 58.0f, 105.0f, 83.0f, 40.0f, 22.0f, 8.0f, 25.0f, 0.3f, 1.63f, 1.55f},

            {250.0f, 32.0f, 0.0f, 35.3f, 35.8f, 10.0f, 55.0f, 135.0f, 80.0f, 58.0f, 108.0f, 86.0f, 48.0f, 25.0f, 9.0f, 32.0f, 0.3f, 3.39f, 3.12f},
            {250.0f, 35.0f, 0.0f, 38.3f, 38.8f, 10.0f, 60.0f, 135.0f, 80.0f, 58.0f, 108.0f, 86.0f, 48.0f, 25.0f, 9.0f, 32.0f, 0.3f, 3.42f, 3.18f},
            {250.0f, 36.0f, 0.0f, 39.3f, 39.8f, 10.0f, 60.0f, 135.0f, 80.0f, 58.0f, 108.0f, 86.0f, 48.0f, 25.0f, 9.0f, 32.0f, 0.3f, 3.40f, 3.15f},
            {250.0f, 0.0f, 38.0f, 41.3f, 41.8f, 10.0f, 60.0f, 135.0f, 80.0f, 58.0f, 108.0f, 86.0f, 48.0f, 25.0f, 9.0f, 32.0f, 0.3f, 3.32f, 3.07f},
            {250.0f, 40.0f, 0.0f, 43.3f, 44.4f, 12.0f, 60.0f, 166.0f, 110.0f, 82.0f, 138.0f, 110.0f, 48.0f, 25.0f, 9.0f, 32.0f, 0.3f, 3.66f, 3.30f},
            {250.0f, 0.0f, 42.0f, 45.3f, 46.4f, 12.0f, 65.0f, 166.0f, 110.0f, 82.0f, 138.0f, 110.0f, 48.0f, 25.0f, 9.0f, 32.0f, 0.3f, 3.90f, 3.61f},
            {250.0f, 45.0f, 0.0f, 48.8f, 49.9f, 14.0f, 70.0f, 166.0f, 110.0f, 82.0f, 138.0f, 110.0f, 48.0f, 25.0f, 9.0f, 32.0f, 0.3f, 4.11f, 3.82f},

            {400.0f, 0.0f, 38.0f, 41.3f, 41.8f, 10.0f, 63.0f, 166.0f, 80.0f, 58.0f, 113.0f, 91.0f, 56.0f, 30.0f, 10.0f, 38.0f, 0.3f, 5.43f, 5.17f},
            {400.0f, 40.0f, 0.0f, 43.3f, 44.4f, 12.0f, 63.0f, 166.0f, 110.0f, 82.0f, 143.0f, 115.0f, 56.0f, 30.0f, 10.0f, 38.0f, 0.3f, 5.78f, 5.49f},
            {400.0f, 0.0f, 42.0f, 45.3f, 46.4f, 12.0f, 70.0f, 166.0f, 110.0f, 82.0f, 143.0f, 115.0f, 56.0f, 30.0f, 10.0f, 38.0f, 0.3f, 6.21f, 5.65f},
            {400.0f, 45.0f, 0.0f, 48.8f, 49.9f, 14.0f, 70.0f, 166.0f, 110.0f, 82.0f, 143.0f, 115.0f, 56.0f, 30.0f, 10.0f, 38.0f, 0.3f, 5.82f, 5.26f},
            {400.0f, 0.0f, 48.0f, 51.8f, 52.9f, 14.0f, 75.0f, 166.0f, 110.0f, 82.0f, 143.0f, 115.0f, 56.0f, 30.0f, 10.0f, 38.0f, 0.3f, 6.31f, 5.75f},
        };

        const QStringList params_table_headings = {
            "Номинальный крутящий момент Mкр, Н·м",
            "d (пред. откл. по H7) - 1-й ряд",
            "d (пред. откл. по H7) - 2-й ряд",
            "d + t₁ (Исполнение 1)",
            "d + t₁ (Исполнение 2)",
            "b",
            "d₁",
            "D",
            "l (Исполнение 1)",
            "l (Исполнение 2)",
            "l₁ (Исполнение 1)",
            "l₁ (Исполнение 2)",
            "l₂",
            "l₃",
            "B (пред. откл. +0.1)",
            "B₁",
            "r",
            "Масса, кг (Исполнение 1)",
            "Масса, кг (Исполнение 2)"
        };
    }
    
    void initModel3D() override;
    void drawSketch(SketchWidget *sketch) override;
};

// Звездочка
struct Sprocket : Model {
    Sprocket() {
        const QStringList params_table_headings = {
            "Номинальный крутящий момент, Мкр, Н·м",
            "D",
            "d",
            "B (пред. откл. +0,2)",
            "H",
            "r",
            "Масса, кг"
        };

        params_table = {
            {2.5f, 30.0f, 0.0f, 8.5f, 0.0f, 1.25f, 0.009f},   // Первая строка из первой таблицы
            {6.3f, 42.0f, 0.0f, 10.5f, 0.0f, 1.6f, 0.012f},   // Вторая строка из первой таблицы

            {16.0f, 50.0f, 26.0f, 10.5f, 15.0f, 1.6f, 0.032f}, // Строки из второй таблицы
            {25.0f, 60.0f, 30.0f, 12.5f, 15.0f, 1.6f, 0.040f},
            {31.5f, 67.0f, 30.0f, 12.5f, 15.0f, 1.6f, 0.043f},  // d не указано — 0
            {63.0f, 80.0f, 36.0f, 14.5f, 22.0f, 2.0f, 0.090f},
            {125.0f, 100.0f, 45.0f, 16.5f, 22.0f, 2.0f, 0.135f}, // H не указано — 0
            {250.0f, 130.0f, 56.0f, 18.5f, 25.0f, 3.0f, 0.264f},
            {400.0f, 160.0f, 67.0f, 20.5f, 30.0f, 3.0f, 0.485f} // r не указано — 0
        };
    }
    
    void initModel3D() override;
    void drawSketch(SketchWidget *sketch) override;
};

struct Detail1 : Model {
    void initModel3D() override;
    void drawSketch(SketchWidget *sketch) override;
};